# CurveElemDefinesSlope Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..CurveElemDefinesSlope Property
ParameterTypeId Class See Also
---
"Defines Beam System Slope"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId CurveElemDefinesSlope { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property CurveElemDefinesSlope As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ CurveElemDefinesSlope {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace